apache/nuttx/arch/arm/src/stm32l4/stm32l4_dac.c
/* DMA stream/channel configuration */

#define DAC_DMA_CONTROL_WORD (DMA_CCR_MSIZE_16BITS | \
                              DMA_CCR_PSIZE_16BITS | \
                              DMA_CCR_MINC | \
                              DMA_CCR_CIRC | \
                              DMA_CCR_DIR)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure represents the internal state of the single STM32 DAC
 * block
 */

struct stm32_dac_s
{
  uint8_t    init   : 1; /* True, the DAC block has been initialized */
};

/* This structure represents the internal state of one STM32 DAC channel */

struct stm32_chan_s
{
#ifdef CONFIG_STM32_DAC_LL_OPS
  const struct stm32_dac_ops_s *llops; /* Low-level DAC ops */
#endif
  uint8_t    inuse  : 1; /* True, the driver is in use and not available */
#ifdef HAVE_DMA
  uint8_t    hasdma : 1; /* True, this channel supports DMA */
  uint8_t    timer;      /* Timer number 2-8 */
#endif
  uint8_t    intf;       /* DAC zero-based interface number (0 or 1) */
  uint32_t   pin;        /* Pin configuration */
  uint32_t   dro;        /* Data output register */
  uint32_t   cr;         /* Control register */
  uint32_t   tsel;       /* CR trigger select value */
#ifdef HAVE_DMA
  uint16_t   dmachan;    /* DMA channel needed by this DAC */
  uint16_t   buffer_len; /* DMA buffer length */
  DMA_HANDLE dma;        /* Allocated DMA channel */
  uint32_t   tbase;      /* Timer base address */
  uint32_t   tfrequency; /* Timer frequency */
  int        result;     /* DMA result */
  uint16_t   buffer_pos; /* Position in dmabuffer where to write new value */
  uint16_t   *dmabuffer; /* DMA transfer buffer */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* DAC Register access */

static uint32_t dac_getreg(struct stm32_chan_s *priv, int offset);
static void     dac_dumpregs(struct stm32_chan_s *priv);

#ifdef HAVE_DMA
static inline void tim_putreg(struct stm32_chan_s *chan, int offset,
                              uint32_t value);
static inline void tim_modifyreg(struct stm32_chan_s *chan, int offset,
                                 uint32_t clearbits, uint32_t setbits);
#endif

/* DAC methods */

static void dac_reset(struct dac_dev_s *dev);
static int  dac_setup(struct dac_dev_s *dev);
static void dac_shutdown(struct dac_dev_s *dev);
static void dac_txint(struct dac_dev_s *dev, bool enable);
static int  dac_send(struct dac_dev_s *dev, struct dac_msg_s *msg);
static int  dac_ioctl(struct dac_dev_s *dev, int cmd, unsigned long arg);

/* Initialization */

#ifdef HAVE_DMA
static int  dac_timinit(struct stm32_chan_s *chan);
#endif
static int  dac_chaninit(struct stm32_chan_s *chan);
static void dac_blockinit(void);

#ifdef CONFIG_STM32_DAC_LL_OPS
static void dac_llops_enable(struct stm32_dac_dev_s *dev, bool enabled);
static void dac_llops_writedro(struct stm32_dac_dev_s *dev, uint16_t data);
#ifdef HAVE_DMA
static void dac_llops_startdma(struct stm32_dac_dev_s *dev);
static void dac_llops_stopdma(struct stm32_dac_dev_s *dev);
#endif
static void dac_llops_dumpregs(struct stm32_dac_dev_s *dev);
#endif /* CONFIG_STM32_DAC_LL_OPS */

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct dac_ops_s g_dacops =
{
  .ao_reset    = dac_reset,
  .ao_setup    = dac_setup,
  .ao_shutdown = dac_shutdown,
  .ao_txint    = dac_txint,
  .ao_send     = dac_send,
  .ao_ioctl    = dac_ioctl,
};

/* Publicly visible DAC lower-half operations */

#ifdef CONFIG_STM32_DAC_LL_OPS
static const struct stm32_dac_ops_s g_dac_llops =
{
  .enable        = dac_llops_enable,
  .write_dro     = dac_llops_writedro,
#ifdef HAVE_DMA
  .start_dma     = dac_llops_startdma,
  .stop_dma      = dac_llops_stopdma,
#endif
  .dump_regs     = dac_llops_dumpregs
};
#endif /* CONFIG_STM32_DAC_LL_OPS */

#ifdef CONFIG_STM32_DAC1
/* Channel 1 */

#ifdef CONFIG_STM32_DAC1_DMA
uint16_t stm32_dac1_dmabuffer[CONFIG_STM32_DAC1_DMA_BUFFER_SIZE];
#endif

static struct stm32_chan_s g_dac1priv =
{
#ifdef CONFIG_STM32_DAC_LL_OPS
  .llops      = &g_dac_llops,
#endif
  .intf       = 0,
#ifdef CONFIG_STM32_DAC1_OUTPUT_ADC
  .pin        = 0xffffffffu,
#else
  .pin        = GPIO_DAC1_OUT,
#endif
  .dro        = STM32_DAC_DHR12R1,
  .cr         = STM32_DAC_CR,
#ifdef CONFIG_STM32_DAC1_DMA
  .hasdma     = 1,
  .dmachan    = DAC1_DMA_CHAN,
  .buffer_len = CONFIG_STM32_DAC1_DMA_BUFFER_SIZE,
  .dmabuffer  = stm32_dac1_dmabuffer,
  .timer      = CONFIG_STM32_DAC1_TIMER,
  .tsel       = DAC1_TSEL_VALUE,
  .tbase      = DAC1_TIMER_BASE,
  .tfrequency = CONFIG_STM32_DAC1_TIMER_FREQUENCY,
#endif
};

static struct dac_dev_s g_dac1dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac1priv,
};

#endif /* CONFIG_STM32_DAC1 */

#ifdef CONFIG_STM32_DAC2
/* Channel 2 */

#ifdef CONFIG_STM32_DAC2_DMA
uint16_t stm32_dac2_dmabuffer[CONFIG_STM32_DAC2_DMA_BUFFER_SIZE];
#endif

static struct stm32_chan_s g_dac2priv =
{
#ifdef CONFIG_STM32_DAC_LL_OPS
  .llops      = &g_dac_llops,
#endif
  .intf       = 1,
#ifdef CONFIG_STM32_DAC2_OUTPUT_ADC
  .pin        = 0xffffffffu,
#else
  .pin        = GPIO_DAC2_OUT,
#endif
  .dro        = STM32_DAC_DHR12R2,
  .cr         = STM32_DAC_CR,
#ifdef CONFIG_STM32_DAC2_DMA
  .hasdma     = 1,
  .dmachan    = DAC2_DMA_CHAN,
  .buffer_len = CONFIG_STM32_DAC2_DMA_BUFFER_SIZE,
  .dmabuffer  = stm32_dac2_dmabuffer,
  .timer      = CONFIG_STM32_DAC2_TIMER,
  .tsel       = DAC2_TSEL_VALUE,
  .tbase      = DAC2_TIMER_BASE,
  .tfrequency = CONFIG_STM32_DAC2_TIMER_FREQUENCY,
#endif
};

static struct dac_dev_s g_dac2dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac2priv,
};

#endif /* CONFIG_STM32_DAC2 */

static struct stm32_dac_s g_dacblock;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: dac_getreg
 *
 * Description:
 *   Read the value of an DAC register.
 *
 * Input Parameters:
 *   priv   - A reference to the DAC block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t dac_getreg(struct stm32_chan_s *priv, int offset)
{
  return getreg32(STM32_DAC_BASE + offset);
}

/****************************************************************************
 * Name: stm32_dac_modify_cr
 *
 * Description:
 *   Modify the contents of the DAC control register.
 *
 * Input Parameters:
 *   chan - A reference to the DAC channel state data
 *   clearbits - Bits in the control register to be cleared
 *   setbits - Bits in the control register to be set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_dac_modify_cr(struct stm32_chan_s *chan,
                                         uint32_t clearbits,
                                         uint32_t setbits)
{
  unsigned int shift;

