apache/nuttx/arch/arm/src/stm32l4/stm32l4_dac.c
  prescaler = (pclk / chan->tfrequency + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = pclk / prescaler;

  reload = timclk / chan->tfrequency;
  if (reload < 1)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }

  /* Set the reload and prescaler values */

  tim_putreg(chan, STM32_GTIM_ARR_OFFSET, (uint16_t)reload);
  tim_putreg(chan, STM32_GTIM_PSC_OFFSET, (uint16_t)(prescaler - 1));

  /* Count mode up, auto reload */

  tim_modifyreg(chan, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_ARPE);

  /* Selection TRGO selection: update */

  tim_modifyreg(chan, STM32_GTIM_CR2_OFFSET, GTIM_CR2_MMS_MASK,
                GTIM_CR2_MMS_UPDATE);

  /* Update DMA request enable ???? */
#if 0
  tim_modifyreg(chan, STM32_GTIM_DIER_OFFSET, 0, GTIM_DIER_UDE);
#endif

  /* Enable the counter */

  tim_modifyreg(chan, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_CEN);
  return OK;
}
#endif

/****************************************************************************
 * Name: dac_chaninit
 *
 * Description:
 *   Initialize the DAC channel.
 *
 * Input Parameters:
 *   chan - A reference to the DAC channel state data
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int dac_chaninit(struct stm32_chan_s *chan)
{
  uint16_t clearbits;
  uint16_t setbits;

  /* Is the selected channel already in-use? */

  if (chan->inuse)
    {
      /* Yes.. then return EBUSY */

      return -EBUSY;
    }

  /* Configure the DAC output pin:
   *
   * DAC -" Once the DAC channelx is enabled, the corresponding GPIO pin
   * (PA4 or PA5) is automatically connected to the analog converter output
   * (DAC_OUTx). In order to avoid parasitic consumption, the PA4 or PA5 pin
   * should first be configured to analog (AIN)".
   */

  if (chan->pin != 0xffffffffu)
    {
      stm32_configgpio(chan->pin);
    }

  /* DAC channel configuration:
   *
   * - Set the trigger selection based upon the configuration.
   * - Set wave generation == None.
   * - Enable the output buffer.
   */

  /* Disable before change */

  stm32_dac_modify_cr(chan, DAC_CR_EN, 0);

  clearbits = DAC_CR_TSEL_MASK |
              DAC_CR_MAMP_MASK |
              DAC_CR_WAVE_MASK;
  setbits =
      chan->tsel |           /* Set trigger source (SW or timer TRGO event) */
      DAC_CR_MAMP_AMP1 |     /* Set waveform characteristics */
      DAC_CR_WAVE_DISABLED;  /* Set no noise */
  stm32_dac_modify_cr(chan, clearbits, setbits);

  /* Enable output buffer or route DAC output to on-chip peripherals (ADC) */

  clearbits = DAC_MCR_MODE1_MASK;
  if (chan->pin != 0xffffffffu)
    {
      setbits = DAC_MCR_MODE_EXTBUF;
    }
  else
    {
      setbits = DAC_MCR_MODE_IN;
    }

  stm32_dac_modify_mcr(chan, clearbits, setbits);

#ifdef HAVE_DMA
  /* Determine if DMA is supported by this channel */

  if (chan->hasdma)
    {
      int ret;

      /* Yes.. DAC trigger enable */

      stm32_dac_modify_cr(chan, 0, DAC_CR_TEN);

      /* Allocate a DMA channel */

      chan->dma = stm32_dmachannel(chan->dmachan);
      if (!chan->dma)
        {
          aerr("ERROR: Failed to allocate a DMA channel\n");
          return -EBUSY;
        }

      /* Configure the timer that supports the DMA operation */

      ret = dac_timinit(chan);
      if (ret < 0)
        {
          aerr("ERROR: Failed to initialize the DMA timer: %d\n", ret);
          stm32_dmafree(chan->dma);
          return ret;
        }
    }
#endif

  /* Mark the DAC channel "in-use" */

  chan->inuse = 1;
  return OK;
}

/****************************************************************************
 * Name: dac_blockinit
 *
 * Description:
 *   Initialize the DAC block.
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void dac_blockinit(void)
{
  irqstate_t flags;
  uint32_t regval;

  /* Has the DAC block already been initialized? */

  if (g_dacblock.init)
    {
      return;
    }

  /* Put the entire DAC block in reset state */

  flags   = enter_critical_section();
  regval  = getreg32(STM32_RCC_APB1RSTR1);
  regval |= RCC_APB1RSTR1_DAC1RST;
  putreg32(regval, STM32_RCC_APB1RSTR1);

  /* Take the DAC out of reset state */

  regval &= ~RCC_APB1RSTR1_DAC1RST;
  putreg32(regval, STM32_RCC_APB1RSTR1);
  leave_critical_section(flags);

  /* Mark the DAC block as initialized */

  g_dacblock.init = 1;
}

#ifdef CONFIG_STM32_DAC_LL_OPS

/****************************************************************************
 * Name: dac_llops_enable
 ****************************************************************************/

static void dac_llops_enable(struct stm32_dac_dev_s *dev, bool enabled)
{
  struct stm32_chan_s *priv = (struct stm32_chan_s *)dev;

  /* Enable/disable DAC Channel */

  if (enabled)
    {
      stm32_dac_modify_cr(priv, 0, DAC_CR_EN);
    }
  else
    {
      stm32_dac_modify_cr(priv, DAC_CR_EN, 0);
    }
}

/****************************************************************************
 * Name: dac_llops_writedro
 ****************************************************************************/

static void dac_llops_writedro(struct stm32_dac_dev_s *dev, uint16_t data)
{
  struct stm32_chan_s *priv = (struct stm32_chan_s *)dev;

  putreg16(data, priv->dro);
}

/****************************************************************************
 * Name: dac_llops_startdma
 ****************************************************************************/
#ifdef HAVE_DMA
static void dac_llops_startdma(struct stm32_dac_dev_s *dev)
{
  struct stm32_chan_s *priv = (struct stm32_chan_s *)dev;

  /* Configure the DMA stream/channel.
   *
   * - Channel number
   * - Peripheral address
   * - Direction: Memory to peripheral
   * - Disable peripheral address increment
   * - Enable memory address increment
   * - Peripheral data size: half word
   * - Mode: circular???
   * - Priority: ?
   * - FIFO mode: disable
   * - FIFO threshold: half full
   * - Memory Burst: single
   * - Peripheral Burst: single
   */

  stm32_dmasetup(priv->dma, priv->dro, (uint32_t)priv->dmabuffer,
                    priv->buffer_len, DAC_DMA_CONTROL_WORD);

  /* Start the DMA */

  priv->result = -EBUSY;
  stm32_dmastart(priv->dma, dac_dmatxcallback, priv, false);

  /* Enable DMA for DAC Channel */

  stm32_dac_modify_cr(priv, 0, DAC_CR_DMAEN);

