apache/nuttx/arch/arm/src/stm32l4/stm32l4_dac.c
  /* Reset counters (generate an update) */

  tim_modifyreg(priv, STM32_GTIM_EGR_OFFSET, 0, GTIM_EGR_UG);
}

/****************************************************************************
 * Name: dac_llops_stopdma
 ****************************************************************************/

static void dac_llops_stopdma(struct stm32_dac_dev_s *dev)
{
  struct stm32_chan_s *priv = (struct stm32_chan_s *)dev;

  /* Stop the DMA */

  priv->result = -EBUSY;
  stm32_dmastop(priv->dma);

  /* Enable DMA for DAC Channel */

  stm32_dac_modify_cr(priv, 0, DAC_CR_DMAEN);
}
#endif

/****************************************************************************
 * Name: adc_llops_dumpregs
 ****************************************************************************/

static void dac_llops_dumpregs(struct stm32_dac_dev_s *dev)
{
  struct stm32_chan_s *priv = (struct stm32_chan_s *)dev;

  dac_dumpregs(priv);
}

#endif  /* CONFIG_STM32_DAC_LL_OPS */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_dacinitialize
 *
 * Description:
 *   Initialize the DAC.
 *
 * Input Parameters:
 *   intf - The DAC interface number.
 *
 * Returned Value:
 *   Valid dac device structure reference on success; a NULL on failure.
 *
 * Assumptions:
 *   1. Clock to the DAC block has enabled,
 *   2. Board-specific logic has already configured
 *
 ****************************************************************************/

struct dac_dev_s *stm32_dacinitialize(int intf)
{
  struct dac_dev_s    *dev;
  struct stm32_chan_s *chan;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_STM32_DAC1
      case 0:
        ainfo("DAC1-1 Selected\n");
        dev = &g_dac1dev;
        break;
#endif
#ifdef CONFIG_STM32_DAC2
      case 1:
        ainfo("DAC1-2 Selected\n");
        dev = &g_dac2dev;
        break;
#endif
      default:
        aerr("ERROR: No such DAC interface: %d\n", intf);
        return NULL;
    }

  /* Make sure that the DAC block has been initialized */

  dac_blockinit();

  /* Configure the selected DAC channel */

  chan = dev->ad_priv;
  ret  = dac_chaninit(chan);
  if (ret < 0)
    {
      aerr("ERROR: Failed to initialize DAC channel %d: %d\n", intf, ret);
      return NULL;
    }

  return dev;
}

#endif /* CONFIG_STM32_DAC1 || CONFIG_STM32_DAC2 */
#endif /* CONFIG_DAC */
